app/views/user/index.html.erb

SELECT `countries`.* FROM `countries`
---
			  	<strong><%= f.label :country_id,"Country" %></strong>
				<%= f.collection_select(:country_id, Country.all, :id, :country_name,{ prompt: 'Select Country' },{class:"form-control form-control-sm"}) %>