app/controllers/registration_controller.rb

INSERT INTO `users` (`first_name`, `last_name`, `email`, `country_id`, `city_id`, `created_at`, `updated_at`) VALUES ('dsfds', 'dsfdsfds', 'vishal@yopmail.com', 1, 1, '2018-05-16 13:01:33', '2018-05-16 13:01:33')
SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
SELECT  `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
---
  def view
	@user=User.new(user_params)
    if @user.save
	    @country=Country.find_by(id: @user.country)
	    @city=City.find_by(id: @user.city)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 51 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 79 LIMIT 1
---
  def email
    id=params[:id]
    @user=User.find_by(id: id)
    UserMailer.with(user: @user).confirmation_email.deliver_now

SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
---
  def show_cities
    @cities = City.where("country_id = ?", params[:country_id])