app/controllers/user_controller.rb

  def view
  @user = User.new(user_params)
    if @user.save
	    @country=Country.find_by(id: @user.country)
	    @city=City.find_by(id: @user.city)
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `country_id`, `city_id`, `created_at`, `updated_at`) VALUES ('Vishal', 'Singh', 'vishal@yopmail.com', 1, 1, '2018-05-17 12:32:25', '2018-05-17 12:32:25')
SELECT  `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1

  def email

    id = params[:id]
    @user = User.find_by(id: id)
    @country=Country.find_by(id: @user.country)
    @city=City.find_by(id: @user.city)
    @confirmation_alert="Confirmation Email Has Been Sent You Successfully. Kindly Check."
    UserMailer.with(user: @user).confirmation_email.deliver_now
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 87 LIMIT 1
SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1
SELECT  `countries`.* FROM `countries` WHERE `countries`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1

  def show_cities
    @cities = City.where("country_id = ?", params[:country_id])
---
SELECT `cities`.* FROM `cities` WHERE (country_id = '1')